/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   01_op_live.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mschimme <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/25 18:22:49 by mschimme          #+#    #+#             */
/*   Updated: 2020/09/12 15:24:28 by mschimme         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <cwr.h>

/*
*Задачи:
	?	Считать оп-код по текущему положеню указателя. Записать в carry->op его
		? значение, если верный; Передвинуть на 1 байт оффсет-указатель, если
		? неверный.
*/
void		op_live(t_world *nexus, t_carry *carry, \
							t_dvasa *head, t_dvasa **vacant)
{
	
}