/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   12_op_fork.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mschimme <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/25 18:22:49 by mschimme          #+#    #+#             */
/*   Updated: 2020/09/08 14:40:08 by mschimme         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <cwr.h>

/*
TODO:	Сделать.
!Контракт:
	*	Использует ft_dupe_carry для создания копии каретки.
	*	Должна самостоятельно создавать контейнер t_vasa под новую каретку.
	*	Обновляет положение указателя новой каретки.
	*	Должна организовать помещение новой каректи в очередь на исполнения,
		* используя предусмотренную для этого ОБЩУЮ функцию.
*/
void		op_fork(t_world *nexus, t_carry *carry, \
							t_dvasa *head, t_dvasa **vacant)
{
	(void)nexus;
	(void)carry;
	(void)head;
	(void)vacant;
}