/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   _del_carry.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ycorrupt <ycorrupt@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/17 14:46:53 by mschimme          #+#    #+#             */
/*   Updated: 2020/09/25 01:04:50 by ycorrupt         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <cwr.h>

/*
**	//? Использование под вопросом, при текущей конфигурации структуры.
*/

void		ft_del_carry(void *ptr, size_t size)
{
	// DEBfunc()
	// DEBmesst("Проверь, всё ли чистит. Написана ДО того, как определено содержимое структуры")
	(void)size;
	if (ptr)
	{
		free((void *)ptr);
	}
}
