/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   _del_error.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mschimme <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/17 15:08:40 by mschimme          #+#    #+#             */
/*   Updated: 2020/07/01 16:18:35 by mschimme         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <cwr.h>

/*
**	//? Использование под вопросом, при текущей конфигурации структуры.
*/

void		ft_del_error(void *ptr, size_t size)
{
	// DEBfunc()
	// DEBmesst("Проверь, всё ли чистит. Написана ДО того, как определено содержимое структуры")
	(void)size;
	if (ptr)
	{
		free((void *)ptr);
	}
}